Revit 2026 API

# ComponentRepeaterRemoveRepeaters Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ISet<ElementId> RemoveRepeaters(
	Document document,
	ISet<ElementId> elementIds
)
```
```vb
Public Shared Function RemoveRepeaters (
	document As Document,
	elementIds As ISet(Of ElementId)
) As ISet(Of ElementId)
```
```cpp
public:
static ISet<ElementId^>^ RemoveRepeaters(
	Document^ document,
	ISet<ElementId^>^ elementIds
)
```
```fsharp
static member RemoveRepeaters :
        document : Document *
        elementIds : ISet<ElementId> -> ISet<ElementId>
```

#### Parameters

document Document

elementIds ISetElementId

#### Return Value

ISetElementId

#### Reference

ComponentRepeater Class

Autodesk.Revit.DB Namespace